<template>
  <div>
    <h1>背景介绍</h1>
    <p>
      摩捷出行管理平台是一个迭代了多年的微前端项目，开发人员为前端外协和后端外协同事。因为业务反馈操作非常不便，需要提升平台使用体验。
    </p>

    <h2>任务目标</h2>
    <p>查找项目问题，能够提供更为友好的展示效果。如列表页不要存在两个下拉列表。</p>

    <h2>个人目标</h2>
    <p>
      实现组件库：能够提供给业务人员较好的交互体验和展示效果，同时提高前端开发效率。因无现有的组件规则和UI规则，需独自总结所需组件并设计实现。
    </p>
    <p>重构：使用最为合理的架构重构管理平台。让前端能够可持续、更高效的进行迭代开发。</p>
    <p>完善前端规范：根据了解到的问题，补充自己根据经验总结的前端规范。</p>

    <h2>工作计划</h2>
    <p>
      因为没有接触过这个平台，对问题一无所知。计划查看所有页面来整理问题，做出重构规划并实现。文档的菜单顺序就是重构的过程。
    </p>
  </div>
</template>

<script setup></script>

<style scoped></style>
